@magodo 

thanks for your reply

you have two different code samples, the first is for "examplesub" and the second is for "mgd"

is this an either one is enough, or do you need to resource block to add the alias and then reference it in an import to fetch it to state?

For my command, the resource label and alias are the same for simplicity

When I add the resource as per your first section  

```
>resource "azurerm_subscription" "ProdNet" {
  alias             = "ProdNet"
  subscription_name = "ProdNet"
  subscription_id   = "dbbbbbbb-8bbb-4bbb-bbbb-5aaebbbbbb3d"
}

```
When I plan it out is says it's going to create the subscription, yet it already exists.
I can't destroy these subscriptions.  I'm hoping 'will be created' means 'will add existing to state'.  
Will it overwrite my existing? It doesn't say it's  going to destroy anything....

```

# azurerm_subscription.ProdNet will be created
  + resource "azurerm_subscription" "ProdNet" {
      + alias             = "ProdNet"
      + id                = (known after apply)
      + subscription_id   = "dbbbbbbb-8bbb-4bbb-bbbb-5aaebbbbbb3d"
      + subscription_name = "ProdNet"
      + tags              = (known after apply)
      + tenant_id         = (known after apply)
   }

```
When I try to import the subscription it fails, and throws an error that my provider configuration will fail as well.  This error is what I interpreted as the redirect in the registry page to create an alias as above.  So then the import is not necessary after we have the resource block in the code?

```
> terraform import azurerm_subscription.ProdNet "/providers/Microsoft.Subscription/aliases/ProdNet"

azurerm_subscription.ProdNet: Importing from ID "/providers/Microsoft.Subscription/aliases/ProdNet"...
╷
│ Error: failed reading Subscription Alias: subscription.AliasClient#Get: Failure responding to request: 
StatusCode=404 -- Original Error: autorest/azure: Service returned an error. Status=404 Code="SubscriptionAliasNotFound" Message="Subscription alias not found"
│
│
╵

╷
│ Error: Invalid provider configuration
│
│   on C:\Repos\-----\main.tf line 49:
│   49: provider "azurerm" {
│
│ The configuration for provider["registry.terraform.io/hashicorp/azurerm"].ProdNet depends on values    
│ that cannot be determined until apply.

```

so on the one hand, it seems if I try to just add the resource specifically by alias with the subscription ID that I know, then I can 'create' that subscription, and presumably it'd be just part of state at that point and all is well.

However, if I want to directly import it into state, that basically is telling me it can't find the alias. 

Do I just go with the resource block in the code and let it 'create' the resource to add it to state without actually trying to create the resource in my environment?

Thanks for your help!

